USE [businessDB_VS_1]

DELETE FROM dbo.Posts;
DELETE FROM dbo.Departments;
DELETE FROM dbo.Companies;
DELETE FROM dbo.Users;
DELETE FROM dbo.ExWorkwers; 
DELETE FROM dbo.Workers;
DELETE FROM dbo.Inform;

-- 1 
INSERT INTO dbo.Posts
	([id_post], [post_name])
VALUES 
	(1, 'Начальник управления'),
	(2, 'Заместитель начальника по АСУ нефтепродуктообеспечения'),
	(3, 'Первый заместитель начальника - главный инженер'),
	(4, 'Заместитель начальника по телекоммуникациям и стоительству'),
	
	(5, 'Директор'),
	(6, 'Главный инженер'),
	(7, 'Инженер АСУ ТП'),
	(8, 'Инженер по ОТ и ПБ'),
	(9, 'Инженер ЦТО'),
	(10, 'Инженер-программист'),
	(11, 'Инспектор по кадрам'),
	(12, 'Начальник отдела'),
	(13, 'Специалист по кадровому учету'),
	(14, 'Тестировщик программных решений'),
	(15, 'Экономист'),
	(16, 'Экономист по труду'),
	(17, 'Дизайнер полиграфии'),
	(18, 'Инженер связи'),
	(19, 'Системный администратор'),
	(20, 'Специалист по информационной безопасности'),
	(21, 'Ведущий инженер по информационным технологиям'),
	(22, 'Бухгалтер')


-- 2 
INSERT INTO dbo.Departments
	([id_department],[department_name])
VALUES
	( 1, N'Отдел информационных систем'),
	( 2, N'Отдел организационно-методического обеспечения АСУ'),
	( 3, N'Отдел обеспечения процессингового центра'),
	( 4, N'Отдел АСУ ТП'),
	( 5, N'Отдел технического обслуживания АЗС и ЦТО СКС'),
	
	( 6, N'Служба информационной безопасности'),
	( 7, N'Отдел постановки, разработки и эксплуатации ПО'),
	( 8, N'Отдел проектирования, сопровождения и эксплуатации ПО'),
	( 9, N'Отдел информационного обеспечения и сетевой инфраструктуры'),
	( 10, N'Отдел внедрения и поддержки корпоративных EAP-решений'),
	
	( 11, N'Служба по ОТ и ПБ'),
	( 12, N'Производственная лаборатория'),
	( 13, N'Сектор по контролю за автотранспортом'),
	( 14, N'Отдел тех. обслуживания вычислительной техники, телекоммуникаций и систем охраны'),
	( 15, N'Отдел обслуживания средств и систем радиосвязи'),
	( 16, N'Отдел компьютерной полиграфии'),
	
	( 17, N'Аппарат при руководстве'),
	( 18, N'Сектор по работе с персоналом'),
	( 19, N'Экономический отдел'),
	( 20, N'Бухгалтерия')

-- 3
INSERT INTO dbo.Companies
	([id_company],[company_name])
VALUES
	( 1, N'Центральный аппарат'),
	( 2, N'НГДУ "Речицанефть"'),
	( 3, N'БГПЗ'), 
	( 4, N'ПУ "Связьинформсервис"'), 
	( 5, N'БелНИПИнефть'),
	( 6, N'УПНПиРС'),
	( 7, N'РУТТ'),
	( 8, N'ПУ "Нефтебурсервис"'), 
	( 9, N'Гос. предпр. "Белоруснефть-Промсервис"'),
	( 10, N'ПУ "Нефтеспецстрой"'), 
	( 11, N'УСО'),
	( 12, N'БВО'),
	( 13, N'ПУ "Нефтеснабкомплект"'),
	( 14, N'УПСР'), 
	( 15, N'УПГР'),
	( 16, N'УПК'),
	( 17, N'Тампонажное управление'),
	( 18, N'СУБР'), 
	( 19, N'Вышкомонтажное управление'),
	( 20, N'Гос. предпр. "БН-Нефтехимпроект"'),
	( 21, N'Представительство в Венесуэле'),
	( 22, N'Филиал в Республике Эквадор'),
	( 23, N'РУП "ПО "Белоруснефть"'), 
	( 24, N'РУП "Белоруснефть-Брестоблнефтепродукт"'), 
	( 25, N'РУП "Белоруснефть-Могилевоблнефтепродукт"'),
	( 26, N'ОАО "Лиданефтепродукт"'),
	( 27, N'РУП "Белоруснефть-Гроднооблнефтепродукт"'),
	( 28, N'ООО "Белоруснефть-Сибирь"'), 
	( 29, N'ОАО "Сейсмотехника"'),
	( 30, N'РУП "Белоруснефть-Особино"'), 
	( 31, N'РУП "Белоруснефть-Минскоблнефтепродукт"'),
	( 32, N'РУП "Белоруснефть-Минскавтозаправка"'),
	( 33, N'РУП "Белоруснефть-Гомельоблнефтепродукт"'),
	( 34, N'РУП "Белоруснефть-Витебскоблнефтепродукт"'), 
	( 35, N'ООО "БН-ЭнергоСервис"'),
	( 36, N'ООО "БН-СпецТранс"'),
	( 37, N'Гос. предпр. "Белоруснефть-Транс"'),
	( 38, N'ОАО "Пуховичинефтепродукт"'), 
	( 39, N'ООО "Сервис Ойл"'),
	( 40, N'Объединенная профсоюзная организация РУП'),
	( 41, N'ОАО "Нефтяная компания "Янгпур"'),
	( 42, N'Филиал в Аргентинской Республике')

-- 4 
INSERT INTO dbo.Users 
	([id_user],[login_user], [password_user])
VALUES
	( 1, N'Admin', N'14c7ac7c0f68c28c4542867669259877e580287df53b910390f2483849bc4f490') -- Password Admin

-- 5 
INSERT INTO dbo.Workers
	([id_worker], [surname], [name_worker], [middleName], [id_post_wf], [post_name_W], [id_department_wf], [department_name_W], [id_company_wf], [company_name_W], [isDismissed])  -- 
VALUES
	( 1, N'Иванов', N'Иван', N'Иванович', 10, 'Инженер-программист', 1,  N'Отдел информационных систем',  4, N'ПУ "Связьинформсервис"',  0) -- 0==false    --   'COMP 1', 'DEP 1', 'POST 1',
--	( 2, N'DELI', N'D2', N'DD3', 1, 'Главный инженер', 1, N'Отдел организации и контроля строительных работ',    40, N'Объединенная профсоюзная организация РУП',  1), -- 1==true 
--	( 3,  N'Иванов', N'Иван', N'Иванович',  1, 'Главный инженер', 1, N'Отдел организации и контроля строительных работ', 11, N'УСО',  1)

-- 6 
INSERT INTO dbo.ExWorkwers
	([id_exWorker], [id_worker_exF], [surname_ex], [name_ex], [middleName_ex], [id_post_Fex], [post_name_W_ex],  [id_department_Fex], [department_name_W_ex], [id_company_Fex], [company_name_W_ex] ) -- [id_worker_exF]) --    
VALUES 
	--(1, 1)
	(1, 2, N'DELI', N'D2', N'DD3',  1, N'Отдел организации и контроля строительных работ', 1, 'Главный инженер', 40, N'Объединенная профсоюзная организация РУП'),
	(2, 3,  N'Иванов', N'Иван', N'Иванович',  1, N'Отдел организации и контроля строительных работ', 1, 'Главный инженер', 11, N'УСО')
-- 7 
INSERT INTO dbo.Inform
	([id_inf], [num_], [surname_], [name_], [middleName_], [post_],
	[company_], [date_doc_], [days_in_], [date_go_],
	[place1_from_], [place2_in_], [place_finish_],
	[purpose_])--,
--	[id_worker], [id_company_in] )
VALUES
	(1, 'K-00001', 'Иванов', 'Иван', 'Иванович', 'Инженер-программист', 
	 'Центральный аппарат', 'понедельник, 20 ноября 2022 г.', '1', 'понедельник, 22 ноября 2022 г.',
	 'Центральный аппарат', 'НГДУ "Речицанефть"', 'Центральный аппарат',
	 'Повышение квалификации') 


